url-shortener/app/controllers/shortened_url_controller.rb

SELECT  "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "shortened_urls" SET "visits" = ?, "updated_at" = ? WHERE "shortened_urls"."id" = ?  [["visits", 1], ["updated_at", "2015-07-22 16:54:44.369417"], ["id", 1]]
---
  def show
    @url = ShortenedUrl.find_by id: params[:id]
    if @url
      @url.update(visits: @url.visits + 1)